home_money.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/ДБ_РабочееМестоПреподавателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДБ_РабочееМестоПреподавателя</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Ученик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расписание</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗанятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

home_money.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/Forms/ФормаРедактированияСобытия/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидСобытия", ВидСобытия) Тогда
		
	КонецЕсли;
	ОписаниеСобытия = Неопределено;
	Если Параметры.Свойство("ОписаниеСобытия", ОписаниеСобытия) Тогда
		Ученик = ОписаниеСобытия.Ученик;
		ДатаЗанятия = ОписаниеСобытия.ДатаЗанятия;
		ВремяЗанятия = ОписаниеСобытия.ВремяНачала;
		КоличествоАкадемическихЧасов = ОписаниеСобытия.КоличествоЧасов;
		СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗанятияПриИзменении(Элемент)
	СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗанятияПриИзменении(Элемент)
	СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьСобытие(Команда)
	СтруктураСобытия = Новый Структура;
	СтруктураСобытия.Вставить("ВидСобытия"		, ВидСобытия);
	СтруктураСобытия.Вставить("ДатаЗанятия"		, ДатаЗанятия);
	СтруктураСобытия.Вставить("ВремяНачала"		, ВремяЗанятия);
	СтруктураСобытия.Вставить("Ученик"			, Ученик);
	СтруктураСобытия.Вставить("КоличествоЧасов"	, КоличествоАкадемическихЧасов);
	СтруктураСобытия.Вставить("Проведено"		, Ложь);
	СтруктураСобытия.Вставить("Идентификатор"	, "");
	Закрыть(СтруктураСобытия);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия)
	ДатаВремяЗанятия = ДатаЗанятия + (ВремяЗанятия - Дата(1, 1, 1));
КонецПроцедуры

#КонецОбласти
